#### Series에서 특정 숫자가 비어있을 때 앞뒤 간격에 맞게 숫자를 채워넣는 방법

In [4]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
# Interpolate를 이용하면 숫자 사이를 채울 수 있다.
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

#### shift와 cumsum을 이용해서 0과 1의 존재유무 판단하기

In [8]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [10]:
df.shift()

      A
0   NaN
1   1.0
2   2.0
3   2.0
4   3.0
5   4.0
6   5.0
7   5.0
8   5.0
9   6.0
10  7.0

In [14]:
df['A'].shift() != df['A']

0      True
1      True
2     False
3      True
4      True
5      True
6     False
7     False
8      True
9      True
10    False
Name: A, dtype: bool

In [16]:
(df['A'].shift() != df['A']).cumsum() # axis는 0과 1다 있음.

0     1
1     2
2     2
3     3
4     4
5     5
6     5
7     5
8     6
9     7
10    7
Name: A, dtype: int32